evidencias/cenario-b-warmup/Teste de Estresse (Warm-up & Fadiga) Rest.txt
Teste de Estresse (Warm-up & Fadiga) Rest


PS C:\ProjetosGit\tcc\tcc-api-performance\k6> docker run --rm -i -v "${PWD}\..:/repo" -w /repo/k6 -e BASE_URL=http://host.docker.internal:8085 grafana/k6 run test-rest.js                                                                                                                            

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-rest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 52 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 156 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 275 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m04.0s), 04/10 VUs, 451 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m05.0s), 05/10 VUs, 653 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m06.0s), 06/10 VUs, 991 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m07.0s), 07/10 VUs, 1293 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m08.0s), 08/10 VUs, 1661 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m09.0s), 09/10 VUs, 1997 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m10.0s), 09/10 VUs, 2382 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m11.0s), 10/10 VUs, 2833 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m11.9s), 10/10 VUs, 3233 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m12.9s), 10/10 VUs, 3738 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m13.9s), 10/10 VUs, 4091 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m14.9s), 10/10 VUs, 4483 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m15.9s), 10/10 VUs, 5042 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m16.9s), 10/10 VUs, 5421 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m17.9s), 10/10 VUs, 5853 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m18.9s), 10/10 VUs, 6304 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m19.9s), 10/10 VUs, 6686 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m20.9s), 10/10 VUs, 7249 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m21.9s), 10/10 VUs, 7667 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m22.9s), 10/10 VUs, 8116 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m23.9s), 10/10 VUs, 8387 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m24.9s), 10/10 VUs, 8553 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m25.9s), 10/10 VUs, 8830 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m26.9s), 10/10 VUs, 9277 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m27.9s), 10/10 VUs, 9819 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m28.9s), 10/10 VUs, 10119 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m29.9s), 10/10 VUs, 10136 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m30.9s), 10/10 VUs, 10166 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m31.9s), 10/10 VUs, 10245 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m32.9s), 10/10 VUs, 10280 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m33.9s), 10/10 VUs, 10333 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m34.9s), 10/10 VUs, 10343 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m35.9s), 10/10 VUs, 10473 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m36.9s), 10/10 VUs, 10606 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m37.9s), 10/10 VUs, 10654 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m38.9s), 10/10 VUs, 10733 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m39.9s), 10/10 VUs, 10910 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m40.9s), 10/10 VUs, 11123 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m41.8s), 09/10 VUs, 11340 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m42.7s), 08/10 VUs, 11478 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  43.0s/50.0s

running (0m43.7s), 07/10 VUs, 11602 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m44.8s), 06/10 VUs, 11706 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m45.8s), 05/10 VUs, 11819 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m46.8s), 04/10 VUs, 11926 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m47.7s), 03/10 VUs, 12002 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m48.8s), 02/10 VUs, 12033 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  49.0s/50.0s

running (0m49.8s), 01/10 VUs, 12057 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 12058   242.310241/s
    checks_succeeded...: 100.00% 12058 out of 12058
    checks_failed......: 0.00%   0 out of 12058

    ✓ status is 201

    HTTP
    http_req_duration..............: avg=33.05ms min=75.15µs med=19.19ms max=1.95s p(90)=59.29ms p(95)=82.24ms
      { expected_response:true }...: avg=33.05ms min=75.15µs med=19.19ms max=1.95s p(90)=59.29ms p(95)=82.24ms
    http_req_failed................: 0.00%  0 out of 12058
    http_reqs......................: 12058  242.310241/s

    EXECUTION
    iteration_duration.............: avg=33.59ms min=6.15ms  med=19.68ms max=1.95s p(90)=59.84ms p(95)=82.94ms
    iterations.....................: 12058  242.310241/s
    vus............................: 1      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 3.6 MB 72 kB/s
    data_sent......................: 2.6 MB 52 kB/s



running (0m49.8s), 00/10 VUs, 12058 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s