evidencias/cenario-b-warmup/Teste de Estresse (Warm-up & Fadiga) graphql.txt
Teste de Estresse (Warm-up & Fadiga) graphql

PS C:\ProjetosGit\tcc\tcc-api-performance\k6> docker run --rm -i -v "${PWD}\..:/repo" -w /repo/k6 -e BASE_URL=http://host.docker.internal:8085 grafana/k6 run test-graphql.js                                                                                                                         

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-graphql.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 128 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 271 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m04.0s), 04/10 VUs, 507 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m05.0s), 05/10 VUs, 744 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m06.0s), 06/10 VUs, 970 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m07.0s), 07/10 VUs, 1219 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m08.0s), 08/10 VUs, 1599 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m09.0s), 09/10 VUs, 1978 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m10.0s), 09/10 VUs, 2346 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m11.0s), 10/10 VUs, 2763 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m12.0s), 10/10 VUs, 3048 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m13.0s), 10/10 VUs, 3404 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m14.0s), 10/10 VUs, 3842 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m15.0s), 10/10 VUs, 4251 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m16.0s), 10/10 VUs, 4626 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m17.0s), 10/10 VUs, 5049 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m18.0s), 10/10 VUs, 5427 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m19.0s), 10/10 VUs, 5862 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m20.0s), 10/10 VUs, 6332 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m21.0s), 10/10 VUs, 6792 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m22.0s), 10/10 VUs, 7212 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m23.0s), 10/10 VUs, 7662 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m24.0s), 10/10 VUs, 8029 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m25.0s), 10/10 VUs, 8439 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m26.0s), 10/10 VUs, 8930 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m27.0s), 10/10 VUs, 9387 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m27.9s), 10/10 VUs, 9946 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m28.9s), 10/10 VUs, 10494 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m29.9s), 10/10 VUs, 10999 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m30.9s), 10/10 VUs, 11405 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m31.9s), 10/10 VUs, 11918 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m32.9s), 10/10 VUs, 12367 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m33.9s), 10/10 VUs, 12926 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m34.9s), 10/10 VUs, 13460 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m35.9s), 10/10 VUs, 13995 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m36.9s), 10/10 VUs, 14498 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m37.9s), 10/10 VUs, 15078 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m38.9s), 10/10 VUs, 15651 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m39.9s), 10/10 VUs, 16163 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m40.9s), 10/10 VUs, 16666 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m41.9s), 09/10 VUs, 17163 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m42.9s), 08/10 VUs, 17540 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  43.0s/50.0s

running (0m43.9s), 07/10 VUs, 17954 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m44.9s), 06/10 VUs, 18357 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m45.9s), 05/10 VUs, 18778 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m46.9s), 04/10 VUs, 19116 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m47.9s), 03/10 VUs, 19418 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m48.9s), 02/10 VUs, 19647 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  49.0s/50.0s

running (0m49.9s), 01/10 VUs, 19761 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 19762   396.201164/s
    checks_succeeded...: 100.00% 19762 out of 19762
    checks_failed......: 0.00%   0 out of 19762

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=20.08ms min=45.09µs med=16.46ms max=896.75ms p(90)=33.32ms p(95)=43.93ms
      { expected_response:true }...: avg=20.08ms min=45.09µs med=16.46ms max=896.75ms p(90)=33.32ms p(95)=43.93ms
    http_req_failed................: 0.00%  0 out of 19762
    http_reqs......................: 19762  396.201164/s

    EXECUTION
    iteration_duration.............: avg=20.47ms min=6.12ms  med=16.8ms  max=983.44ms p(90)=33.83ms p(95)=44.49ms
    iterations.....................: 19762  396.201164/s
    vus............................: 1      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 4.7 MB 95 kB/s
    data_sent......................: 8.2 MB 164 kB/s



running (0m49.9s), 00/10 VUs, 19762 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s